# 판다스 데이터프레임과 시리즈

# 02-1 Series 만들기

In [1]:
import pandas as pd
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [2]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'])
s

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [3]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
s

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

# 02-2 DataFrame 만들기
데이터프레임을 만들기 위해서는 딕셔너리를 DataFrame 클래스에 전달해야 함

In [4]:
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]}) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [5]:
scientists = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died']) # 'Died', 'Aged'의 순서로 열 이름을 전달하여 순서 바꿈
scientists

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [6]:
# OrderedDict 클래스 이용시 순서 보장된 데이터프레임 생성가능
from collections import OrderedDict 

scientists = pd.DataFrame(OrderedDict([ 
    ('Name', ['Rosaline Franklin', 'William Gosset']),
    ('Occupation', ['Chemist', 'Statistician']), 
    ('Born', ['1920-07-25', '1876-06-13']), 
    ('Died', ['1958-04-16', '1937-10-16']), 
    ('Age', [37, 61])
])
) 
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 02-3 데이터프레임에서 시리즈 선택하기
판다스의 데이터를 구성하는 가장 기본 단위는 시리즈

In [7]:
scientists = pd.DataFrame(
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age'])

In [8]:
first_row = scientists.loc['William Gosset'] 
type(first_row)

pandas.core.series.Series

In [9]:
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

# 02-4 index 속성
 시리즈의 인덱스가 들어있음

In [10]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

# 02-5 values 속성 
시리즈의 데이터가 들어있음

In [11]:
print(first_row.values)

['Statistician' '1876-06-13' '1937-10-16' 61]

# 02-6 keys 메서드

In [12]:
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

# 02-7 Series의 mean, min, max, std 메서드

In [13]:
ages = scientists['Age'] 
ages

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [14]:
ages.mean()

49.0

In [15]:
ages.min()

37

In [16]:
ages.max()

61

In [17]:
ages.std()

16.97056274847714

## Series 메서드
- append : 2개 이상의 시리즈 연결
- describe : 요약 통계량 계산
- drop_duplicates : 중복값이 없는 시리즈 반환
- equals : 시리즈에 해당 값을 가진 요소가 있는지 확인
- get_values : 시리즈 값 구하기(values 속성과 동일)
- isin : 시리즈에 포함된 값이 있는지 확인
- replace : 특정 값을 가진 시리즈 값을 교체
- sample : 시리즈에서 임의의 값을 반환
- sort_values : 값을 정렬
- to_frame : 시리즈를 데이터프레임으로 변환

# 02-8 Series와 Boolean 추출

In [20]:
scientists = pd.read_csv('C:/Users/sj123/Downloads/doit_pandas-master/doit_pandas-master/data/scientists.csv')

In [21]:
ages = scientists['Age'] 

ages.max()

90

In [22]:
ages.mean()

59.125

In [23]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

## 시리즈와 브로드캐스팅
- 시리즈나 데이터프레임에 있는 모든 데이터에 대해 한 번에 연산하는 것을 브로드캐스팅이라고 함
- 시리즈처럼 여러 개의 값을 가진 데이터를 벡터, 단순 크기를 나타내는 데이터를 스칼라라고 함

In [24]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [25]:
type(ages > ages.mean())

pandas.core.series.Series

In [26]:
manual_bool_values = [True, True, False, False, True, True, False, True] 
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

# 02-9 벡터와 스칼라를 이용하여 Broadcasting 수행

In [27]:
# 같은 길이의 벡터 연산
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [28]:

ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [29]:
# 벡터에 스칼라 연산
ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [30]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [31]:
pd.Series([1, 100])

0      1
1    100
dtype: int64

In [32]:
# 서로 다른 벡터 연산 : 시리즈와 시리즈를 연산하는 경우 같은 인덱스의 값만 연산, 나머지 값은 누락값(NaN)
ages + pd.Series([1, 100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [33]:
rev_ages = ages.sort_index(ascending=False) 
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [34]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [35]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

# 02-10 Boolean 추출과 Broadcasting

In [36]:
scientists[scientists['Age'] > scientists['Age'].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [38]:
# scientists.loc[[True, True, False, True]]

In [39]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

# 02-11 시리즈와 데이터프레임의 데이터 처리하기

In [40]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [41]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d') 
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [42]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [43]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [44]:
scientists.shape

(8, 7)

In [45]:
scientists['age_days_dt'] = (scientists['died_dt'] - \
                             scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

# 02-12 시리즈, 데이터프레임의 데이터 섞기

In [46]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [47]:
# random 라이브러리에는 데이터를 섞어주는 shuffle메서드가 있음 
# seed메서드는 컴퓨터가 생성하는 난수의 기준값을 정하기 위해 사용
import random

random.seed(42)
random.shuffle(scientists['Age'])
scientists['Age']

C:\Users\sj123\anaconda3\Lib\random.py:383: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

# 02-13 데이터프레임의 열 삭제하기

In [48]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [49]:
scientists_dropped = scientists.drop(['Age'], axis=1)

scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [50]:
# 02-14 CSV파일로 저장하기

In [51]:
# names.to_csv('../output/scientist_names_series.csv')

In [52]:
# scientists.to_csv('../output/scientists_df_no_index.csv', index=False)

In [53]:
# names_df = names.to_frame()

# import xlwt 
# names_df.to_excel('../output/scientists_names_series_df.xls')

# import openpyxl 
# names_df.to_excel('../output/scientists_names_series_df.xlsx')